In [2]:
import pandas as pd
import numpy as np

In [7]:
p = {'Items': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'], 'Days': ['mon', 'tue', 'wed', 'thur', 'fri', 'sat'], 'sales': [100, 80, 200, 100, 5, 10]}

In [10]:
df = pd.DataFrame(p)
df

    Items  Days  sales
0   apple   mon    100
1   apple   tue     80
2  orange   wed    200
3  orange  thur    100
4    guns   fri      5
5    guns   sat     10

In [12]:
x = df.groupby('Items')
x

In [13]:
x.mean()

        sales
Items
apple    90.0
guns      7.5
orange  150.0

In [14]:
x.sum()

        sales
Items
apple     180
guns       15
orange    300

In [18]:
x.median()

        sales
Items
apple    90.0
guns      7.5
orange  150.0

In [20]:
x.describe().transpose()

Items             apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000